from json import load, dump

a = """Вінницькій області
Волинській області
Дніпропетровські області
Донецькій області
Житомирській області
Закарпатській області
Запорізькій області
Івано-Франківській області
Київській області
Кіровоградській області
Луганській області
Львівській області
Миколаївській області
Одеській області
Полтавській області
Рівненській області
Сумській області
Тернопільській області
Харківській області
Херсонській області
Хмельницькій області
Черкаській області
Чернівецькій області
Чернігівській області
м. Києві"""

a = (i for i in a.split("\n"))

new_situation = load(open('JSONs/new_situation.json', "rb"))

for x in range(len(new_situation["situation"])):
    new_situation["situation"][x]["stateName"] = next(a)

f = open('JSONs/new_situation.json', 'w')
dump(new_situation, f)
f.close()
